results/memcached_bench.txt
=== PIPELINE DEPTH: 1 ===
2         Threads
20        Connections per thread
20000     Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        48354.97          ---          ---        31.67222         0.68700         1.79100         7.00700      3730.24 
Gets         5372.77         8.06      5364.72        15.78680         0.67900         1.77500         7.13500       204.59 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      53727.75         8.06      5364.72        30.08368         0.68700         1.79100         7.03900      3934.83 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.039        0.000
SET       0.423        5.000
SET       0.479       10.000
SET       0.511       15.000
SET       0.543       20.000
SET       0.567       25.000
SET       0.591       30.000
SET       0.615       35.000
SET       0.639       40.000
SET       0.663       45.000
SET       0.687       50.000
SET       0.695       52.500
SET       0.711       55.000
SET       0.719       57.500
SET       0.735       60.000
SET       0.743       62.500
SET       0.759       65.000
SET       0.775       67.500
SET       0.791       70.000
SET       0.807       72.500
SET       0.823       75.000
SET       0.831       76.250
SET       0.847       77.500
SET       0.855       78.750
SET       0.871       80.000
SET       0.879       81.250
SET       0.895       82.500
SET       0.911       83.750
SET       0.935       85.000
SET       0.951       86.250
SET       0.975       87.500
SET       0.983       88.125
SET       0.999       88.750
SET       1.015       89.375
SET       1.031       90.000
SET       1.047       90.625
SET       1.063       91.250
SET       1.079       91.875
SET       1.095       92.500
SET       1.119       93.125
SET       1.143       93.750
SET       1.151       94.062
SET       1.167       94.375
SET       1.183       94.688
SET       1.199       95.000
SET       1.215       95.312
SET       1.231       95.625
SET       1.247       95.938
SET       1.271       96.250
SET       1.287       96.562
SET       1.319       96.875
SET       1.327       97.031
SET       1.343       97.188
SET       1.359       97.344
SET       1.383       97.500
SET       1.399       97.656
SET       1.423       97.812
SET       1.447       97.969
SET       1.479       98.125
SET       1.519       98.281
SET       1.559       98.438
SET       1.583       98.516
SET       1.607       98.594
SET       1.639       98.672
SET       1.671       98.750
SET       1.703       98.828
SET       1.743       98.906
SET       1.783       98.984
SET       1.831       99.062
SET       1.887       99.141
SET       1.959       99.219
SET       1.999       99.258
SET       2.047       99.297
SET       2.095       99.336
SET       2.159       99.375
SET       2.223       99.414
SET       2.287       99.453
SET       2.367       99.492
SET       2.463       99.531
SET       2.559       99.570
SET       2.671       99.609
SET       2.735       99.629
SET       2.831       99.648
SET       2.927       99.668
SET       3.039       99.688
SET       3.167       99.707
SET       3.327       99.727
SET       3.487       99.746
SET       3.679       99.766
SET       3.855       99.785
SET       4.191       99.805
SET       4.415       99.814
SET       4.575       99.824
SET       4.767       99.834
SET       4.959       99.844
SET       5.279       99.854
SET       5.439       99.863
SET       5.855       99.873
SET       6.271       99.883
SET       6.719       99.893
SET       7.135       99.902
SET       7.295       99.907
SET       7.391       99.912
SET       7.615       99.917
SET       7.967       99.922
SET       8.767       99.927
SET       9.279       99.932
SET      10.047       99.937
SET      10.623       99.941
SET      10.943       99.946
SET      11.327       99.951
SET      11.455       99.954
SET      11.647       99.956
SET      11.967       99.958
SET      12.095       99.961
SET      12.607       99.963
SET      13.439       99.966
SET      14.271       99.968
SET      14.783       99.971
SET      15.295       99.973
SET      15.487       99.976
SET      15.679       99.977
SET      16.191       99.978
SET      16.895       99.979
SET      18.047       99.980
SET      18.303       99.982
SET      18.431       99.983
SET      19.199       99.984
SET      19.711       99.985
SET      20.863       99.987
SET      23.167       99.988
SET      27.007       99.988
SET      27.135       99.989
SET      29.567       99.990
SET      30.975       99.990
SET      32.383       99.991
SET      42.495       99.991
SET      42.495       99.992
SET      42.751       99.993
SET      42.751       99.993
SET      47.871       99.994
SET      48.127       99.994
SET      57.599       99.995
SET      57.855       99.995
SET    603979.750       99.995
SET    603979.750      100.000
---
GET       0.055        0.000
GET       0.423        5.000
GET       0.479       10.000
GET       0.511       15.000
GET       0.543       20.000
GET       0.567       25.000
GET       0.591       30.000
GET       0.615       35.000
GET       0.639       40.000
GET       0.663       45.000
GET       0.679       50.000
GET       0.695       52.500
GET       0.703       55.000
GET       0.719       57.500
GET       0.735       60.000
GET       0.743       62.500
GET       0.759       65.000
GET       0.775       67.500
GET       0.791       70.000
GET       0.807       72.500
GET       0.823       75.000
GET       0.831       76.250
GET       0.839       77.500
GET       0.855       78.750
GET       0.863       80.000
GET       0.879       81.250
GET       0.895       82.500
GET       0.911       83.750
GET       0.927       85.000
GET       0.943       86.250
GET       0.967       87.500
GET       0.983       88.125
GET       0.991       88.750
GET       1.007       89.375
GET       1.023       90.000
GET       1.039       90.625
GET       1.055       91.250
GET       1.071       91.875
GET       1.095       92.500
GET       1.119       93.125
GET       1.143       93.750
GET       1.159       94.062
GET       1.167       94.375
GET       1.183       94.688
GET       1.191       95.000
GET       1.207       95.312
GET       1.223       95.625
GET       1.247       95.938
GET       1.263       96.250
GET       1.287       96.562
GET       1.311       96.875
GET       1.327       97.031
GET       1.343       97.188
GET       1.359       97.344
GET       1.375       97.500
GET       1.391       97.656
GET       1.415       97.812
GET       1.447       97.969
GET       1.479       98.125
GET       1.519       98.281
GET       1.551       98.438
GET       1.575       98.516
GET       1.599       98.594
GET       1.631       98.672
GET       1.655       98.750
GET       1.687       98.828
GET       1.727       98.906
GET       1.767       98.984
GET       1.807       99.062
GET       1.863       99.141
GET       1.927       99.219
GET       1.967       99.258
GET       2.007       99.297
GET       2.063       99.336
GET       2.095       99.375
GET       2.175       99.414
GET       2.271       99.453
GET       2.335       99.492
GET       2.383       99.531
GET       2.527       99.570
GET       2.655       99.609
GET       2.703       99.629
GET       2.783       99.648
GET       2.911       99.668
GET       3.023       99.688
GET       3.135       99.707
GET       3.231       99.727
GET       3.407       99.746
GET       3.599       99.766
GET       3.759       99.785
GET       3.887       99.805
GET       4.191       99.814
GET       4.319       99.824
GET       4.511       99.834
GET       4.703       99.844
GET       4.959       99.854
GET       5.471       99.863
GET       6.111       99.873
GET       6.623       99.883
GET       6.975       99.893
GET       7.167       99.902
GET       7.263       99.907
GET       7.359       99.912
GET       7.839       99.917
GET       8.255       99.922
GET       8.767       99.927
GET       9.279       99.932
GET       9.919       99.937
GET      10.175       99.941
GET      11.007       99.946
GET      11.135       99.951
GET      11.199       99.954
GET      11.263       99.956
GET      11.327       99.958
GET      11.519       99.961
GET      11.647       99.963
GET      11.775       99.966
GET      13.567       99.968
GET      13.695       99.971
GET      14.271       99.973
GET      14.975       99.976
GET      14.975       99.977
GET      14.975       99.978
GET      15.423       99.979
GET      15.487       99.980
GET      15.551       99.982
GET      15.935       99.983
GET      16.383       99.984
GET      18.303       99.985
GET      18.559       99.987
GET      19.071       99.988
GET      19.071       99.988
GET      19.711       99.989
GET      19.711       99.990
GET      20.351       99.990
GET      20.351       99.991
GET      20.863       99.991
GET      20.863       99.992
GET      23.167       99.993
GET      23.167       99.993
GET      32.383       99.994
GET      32.383       99.994
GET      32.383       99.995
GET      32.383       99.995
GET      42.495       99.995
GET      42.495       99.995
GET      42.495       99.996
GET      42.495       99.996
GET      42.751       99.996
GET      42.751       99.997
GET      42.751       99.997
GET      42.751       99.997
[...]
GET    603979.750       99.998
GET    603979.750      100.000
---
WAIT      0.000      100.000



=== PIPELINE DEPTH: 10 ===
2         Threads
20        Connections per thread
20000     Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       326484.56          ---          ---         1.09256         0.97500         4.09500         8.83100     25185.95 
Gets        36276.06        54.41     36221.65         1.09256         0.97500         4.09500         8.83100      1381.38 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     362760.63        54.41     36221.65         1.09256         0.97500         4.09500         8.83100     26567.33 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.055        0.000
SET       0.487        5.000
SET       0.599       10.000
SET       0.671       15.000
SET       0.719       20.000
SET       0.767       25.000
SET       0.815       30.000
SET       0.855       35.000
SET       0.895       40.000
SET       0.935       45.000
SET       0.975       50.000
SET       0.991       52.500
SET       1.007       55.000
SET       1.031       57.500
SET       1.047       60.000
SET       1.071       62.500
SET       1.095       65.000
SET       1.119       67.500
SET       1.143       70.000
SET       1.167       72.500
SET       1.199       75.000
SET       1.223       76.250
SET       1.239       77.500
SET       1.263       78.750
SET       1.287       80.000
SET       1.311       81.250
SET       1.335       82.500
SET       1.367       83.750
SET       1.407       85.000
SET       1.447       86.250
SET       1.495       87.500
SET       1.519       88.125
SET       1.551       88.750
SET       1.575       89.375
SET       1.607       90.000
SET       1.639       90.625
SET       1.679       91.250
SET       1.719       91.875
SET       1.759       92.500
SET       1.815       93.125
SET       1.871       93.750
SET       1.903       94.062
SET       1.935       94.375
SET       1.983       94.688
SET       2.015       95.000
SET       2.079       95.312
SET       2.143       95.625
SET       2.207       95.938
SET       2.287       96.250
SET       2.367       96.562
SET       2.463       96.875
SET       2.527       97.031
SET       2.591       97.188
SET       2.655       97.344
SET       2.719       97.500
SET       2.799       97.656
SET       2.879       97.812
SET       3.007       97.969
SET       3.103       98.125
SET       3.231       98.281
SET       3.375       98.438
SET       3.455       98.516
SET       3.519       98.594
SET       3.631       98.672
SET       3.743       98.750
SET       3.855       98.828
SET       3.935       98.906
SET       4.063       98.984
SET       4.191       99.062
SET       4.351       99.141
SET       4.607       99.219
SET       4.735       99.258
SET       4.799       99.297
SET       4.895       99.336
SET       4.991       99.375
SET       5.055       99.414
SET       5.151       99.453
SET       5.311       99.492
SET       5.407       99.531
SET       5.631       99.570
SET       5.759       99.609
SET       5.887       99.629
SET       5.951       99.648
SET       6.047       99.668
SET       6.207       99.688
SET       6.367       99.707
SET       6.495       99.727
SET       6.623       99.746
SET       6.815       99.766
SET       6.911       99.785
SET       7.199       99.805
SET       7.359       99.814
SET       7.487       99.824
SET       7.551       99.834
SET       7.679       99.844
SET       7.839       99.854
SET       7.871       99.863
SET       8.063       99.873
SET       8.511       99.883
SET       8.703       99.893
SET       9.087       99.902
SET       9.151       99.907
SET       9.215       99.912
SET       9.215       99.917
SET       9.215       99.922
SET       9.279       99.927
SET       9.471       99.932
SET       9.599       99.937
SET       9.727       99.941
SET       9.919       99.946
SET      10.239       99.951
SET      10.239       99.954
SET      10.623       99.956
SET      10.623       99.958
SET      10.687       99.961
SET      10.687       99.963
SET      10.687       99.966
SET      10.751       99.968
SET      10.751       99.971
SET      10.815       99.973
SET      10.879       99.976
SET      10.879       99.977
SET      10.879       99.978
SET      10.879       99.979
SET      10.943       99.980
SET      11.007       99.982
SET      11.071       99.983
SET      11.199       99.984
SET      11.199       99.985
SET      11.199       99.987
SET      11.199       99.988
SET      11.199       99.988
SET      11.263       99.989
SET      11.263       99.990
SET      11.839       99.990
SET      11.839       99.991
SET      12.671       99.991
SET      12.671       99.992
SET      12.671       99.993
SET      12.671       99.993
SET      12.735       99.994
SET      12.735       99.994
SET      12.735       99.995
SET      12.735       99.995
SET      12.927       99.995
SET      12.927       99.995
SET      12.927       99.996
SET      12.927       99.996
SET      12.991       99.996
SET      12.991       99.997
SET      12.991       99.997
SET      12.991       99.997
[...]
SET      15.103       99.998
SET      15.103       99.998
SET      15.103       99.998
[...]
SET      15.103       99.999
SET      15.103       99.999
SET      15.103       99.999
SET      15.423       99.999
SET      15.423      100.000
---
GET       0.055        0.000
GET       0.487        5.000
GET       0.599       10.000
GET       0.671       15.000
GET       0.719       20.000
GET       0.767       25.000
GET       0.815       30.000
GET       0.855       35.000
GET       0.895       40.000
GET       0.935       45.000
GET       0.975       50.000
GET       0.991       52.500
GET       1.007       55.000
GET       1.031       57.500
GET       1.047       60.000
GET       1.071       62.500
GET       1.095       65.000
GET       1.119       67.500
GET       1.143       70.000
GET       1.167       72.500
GET       1.199       75.000
GET       1.223       76.250
GET       1.239       77.500
GET       1.263       78.750
GET       1.287       80.000
GET       1.311       81.250
GET       1.335       82.500
GET       1.367       83.750
GET       1.407       85.000
GET       1.447       86.250
GET       1.495       87.500
GET       1.519       88.125
GET       1.551       88.750
GET       1.575       89.375
GET       1.607       90.000
GET       1.639       90.625
GET       1.679       91.250
GET       1.719       91.875
GET       1.759       92.500
GET       1.815       93.125
GET       1.871       93.750
GET       1.903       94.062
GET       1.935       94.375
GET       1.983       94.688
GET       2.015       95.000
GET       2.079       95.312
GET       2.143       95.625
GET       2.207       95.938
GET       2.287       96.250
GET       2.367       96.562
GET       2.463       96.875
GET       2.527       97.031
GET       2.591       97.188
GET       2.655       97.344
GET       2.719       97.500
GET       2.799       97.656
GET       2.879       97.812
GET       3.007       97.969
GET       3.103       98.125
GET       3.231       98.281
GET       3.375       98.438
GET       3.455       98.516
GET       3.519       98.594
GET       3.631       98.672
GET       3.743       98.750
GET       3.855       98.828
GET       3.935       98.906
GET       4.063       98.984
GET       4.191       99.062
GET       4.351       99.141
GET       4.607       99.219
GET       4.735       99.258
GET       4.799       99.297
GET       4.895       99.336
GET       4.991       99.375
GET       5.055       99.414
GET       5.151       99.453
GET       5.311       99.492
GET       5.407       99.531
GET       5.631       99.570
GET       5.759       99.609
GET       5.887       99.629
GET       5.951       99.648
GET       6.047       99.668
GET       6.207       99.688
GET       6.367       99.707
GET       6.495       99.727
GET       6.623       99.746
GET       6.815       99.766
GET       6.911       99.785
GET       7.199       99.805
GET       7.359       99.814
GET       7.487       99.824
GET       7.551       99.834
GET       7.679       99.844
GET       7.839       99.854
GET       7.871       99.863
GET       8.063       99.873
GET       8.511       99.883
GET       8.703       99.893
GET       9.087       99.902
GET       9.151       99.907
GET       9.215       99.912
GET       9.215       99.917
GET       9.215       99.922
GET       9.279       99.927
GET       9.471       99.932
GET       9.599       99.937
GET       9.727       99.941
GET       9.919       99.946
GET      10.239       99.951
GET      10.239       99.954
GET      10.623       99.956
GET      10.623       99.958
GET      10.687       99.961
GET      10.687       99.963
GET      10.687       99.966
GET      10.751       99.968
GET      10.751       99.971
GET      10.815       99.973
GET      10.879       99.976
GET      10.879       99.977
GET      10.879       99.978
GET      10.879       99.979
GET      10.943       99.980
GET      11.007       99.982
GET      11.071       99.983
GET      11.199       99.984
GET      11.199       99.985
GET      11.199       99.987
GET      11.199       99.988
GET      11.199       99.988
GET      11.263       99.989
GET      11.263       99.990
GET      11.839       99.990
GET      11.839       99.991
GET      12.671       99.991
GET      12.671       99.992
GET      12.671       99.993
GET      12.671       99.993
GET      12.735       99.994
GET      12.735       99.994
GET      12.735       99.995
GET      12.735       99.995
GET      12.927       99.995
GET      12.927       99.995
GET      12.927       99.996
GET      12.927       99.996
GET      12.991       99.996
GET      12.991       99.997
GET      12.991       99.997
GET      12.991       99.997
[...]
GET      15.103       99.998
GET      15.103       99.998
GET      15.103       99.998
[...]
GET      15.103       99.999
GET      15.103       99.999
GET      15.103       99.999
GET      15.423       99.999
GET      15.423      100.000
---
WAIT      0.000      100.000



=== PIPELINE DEPTH: 50 ===
2         Threads
20        Connections per thread
20000     Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       564457.08          ---          ---         3.18366         2.54300        14.01500        19.45500     43543.83 
Gets        62717.45        94.08     62623.38         3.18402         2.52700        14.07900        19.45500      2388.25 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     627174.53        94.08     62623.38         3.18370         2.54300        14.01500        19.45500     45932.08 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.095        0.000
SET       1.471        5.000
SET       1.711       10.000
SET       1.863       15.000
SET       1.975       20.000
SET       2.079       25.000
SET       2.175       30.000
SET       2.255       35.000
SET       2.351       40.000
SET       2.447       45.000
SET       2.543       50.000
SET       2.591       52.500
SET       2.655       55.000
SET       2.719       57.500
SET       2.799       60.000
SET       2.863       62.500
SET       2.959       65.000
SET       3.055       67.500
SET       3.167       70.000
SET       3.263       72.500
SET       3.375       75.000
SET       3.439       76.250
SET       3.519       77.500
SET       3.599       78.750
SET       3.695       80.000
SET       3.791       81.250
SET       3.935       82.500
SET       4.079       83.750
SET       4.255       85.000
SET       4.447       86.250
SET       4.671       87.500
SET       4.799       88.125
SET       4.927       88.750
SET       5.087       89.375
SET       5.247       90.000
SET       5.375       90.625
SET       5.599       91.250
SET       5.791       91.875
SET       6.015       92.500
SET       6.239       93.125
SET       6.559       93.750
SET       6.687       94.062
SET       6.879       94.375
SET       7.039       94.688
SET       7.231       95.000
SET       7.423       95.312
SET       7.679       95.625
SET       7.903       95.938
SET       8.255       96.250
SET       8.639       96.562
SET       8.959       96.875
SET       9.215       97.031
SET       9.471       97.188
SET       9.727       97.344
SET       9.919       97.500
SET      10.175       97.656
SET      10.495       97.812
SET      11.007       97.969
SET      11.327       98.125
SET      11.775       98.281
SET      12.223       98.438
SET      12.479       98.516
SET      12.671       98.594
SET      12.991       98.672
SET      13.183       98.750
SET      13.503       98.828
SET      13.759       98.906
SET      14.015       98.984
SET      14.207       99.062
SET      14.591       99.141
SET      14.911       99.219
SET      14.975       99.258
SET      15.039       99.297
SET      15.167       99.336
SET      15.359       99.375
SET      15.487       99.414
SET      15.615       99.453
SET      15.743       99.492
SET      15.935       99.531
SET      16.191       99.570
SET      16.383       99.609
SET      16.511       99.629
SET      16.511       99.648
SET      16.767       99.668
SET      16.895       99.688
SET      17.023       99.707
SET      17.535       99.727
SET      17.663       99.746
SET      17.919       99.766
SET      17.919       99.785
SET      18.047       99.805
SET      18.175       99.814
SET      18.303       99.824
SET      18.431       99.834
SET      18.687       99.844
SET      18.943       99.854
SET      18.943       99.863
SET      19.199       99.873
SET      19.327       99.883
SET      19.455       99.893
SET      19.583       99.902
SET      19.711       99.907
SET      19.839       99.912
SET      19.967       99.917
SET      20.095       99.922
SET      20.095       99.927
SET      20.095       99.932
SET      20.095       99.937
SET      20.351       99.941
SET      20.607       99.946
SET      20.735       99.951
SET      20.735       99.954
SET      20.735       99.956
SET      20.735       99.958
SET      20.735       99.961
SET      20.863       99.963
SET      20.863       99.966
SET      20.863       99.968
SET      20.991       99.971
SET      20.991       99.973
SET      21.375       99.976
SET      21.375       99.977
SET      21.375       99.978
SET      21.375       99.979
SET      21.375       99.980
SET      21.375       99.982
SET      21.503       99.983
SET      22.271       99.984
SET      22.399       99.985
SET      22.399       99.987
SET      22.783       99.988
SET      22.783       99.988
SET      22.783       99.989
SET      22.783       99.990
SET      22.783       99.990
SET      23.551       99.991
SET      23.551       99.991
SET      23.551       99.992
SET      23.551       99.993
SET      25.087       99.993
SET      25.087       99.994
SET      25.599       99.994
SET      25.599       99.995
SET      25.599       99.995
SET      25.599       99.995
[...]
SET      25.599       99.996
SET      25.599       99.996
SET      25.599       99.996
SET      25.599       99.997
SET      25.599       99.997
SET      25.599       99.997
[...]
SET      25.599       99.998
SET      25.599       99.998
SET      25.599       99.998
[...]
SET      25.599       99.999
SET      25.599       99.999
SET      25.599       99.999
SET      25.983       99.999
SET      25.983      100.000
---
GET       0.135        0.000
GET       1.471        5.000
GET       1.711       10.000
GET       1.863       15.000
GET       1.975       20.000
GET       2.079       25.000
GET       2.175       30.000
GET       2.255       35.000
GET       2.351       40.000
GET       2.447       45.000
GET       2.527       50.000
GET       2.591       52.500
GET       2.655       55.000
GET       2.719       57.500
GET       2.799       60.000
GET       2.863       62.500
GET       2.959       65.000
GET       3.055       67.500
GET       3.167       70.000
GET       3.263       72.500
GET       3.375       75.000
GET       3.439       76.250
GET       3.519       77.500
GET       3.599       78.750
GET       3.695       80.000
GET       3.791       81.250
GET       3.935       82.500
GET       4.079       83.750
GET       4.255       85.000
GET       4.447       86.250
GET       4.671       87.500
GET       4.799       88.125
GET       4.927       88.750
GET       5.087       89.375
GET       5.247       90.000
GET       5.407       90.625
GET       5.599       91.250
GET       5.791       91.875
GET       6.015       92.500
GET       6.271       93.125
GET       6.559       93.750
GET       6.687       94.062
GET       6.879       94.375
GET       7.039       94.688
GET       7.231       95.000
GET       7.423       95.312
GET       7.679       95.625
GET       7.903       95.938
GET       8.255       96.250
GET       8.639       96.562
GET       8.959       96.875
GET       9.215       97.031
GET       9.471       97.188
GET       9.663       97.344
GET       9.919       97.500
GET      10.175       97.656
GET      10.495       97.812
GET      11.071       97.969
GET      11.391       98.125
GET      11.839       98.281
GET      12.223       98.438
GET      12.479       98.516
GET      12.671       98.594
GET      13.055       98.672
GET      13.183       98.750
GET      13.567       98.828
GET      13.823       98.906
GET      14.015       98.984
GET      14.271       99.062
GET      14.591       99.141
GET      14.911       99.219
GET      14.975       99.258
GET      15.039       99.297
GET      15.167       99.336
GET      15.359       99.375
GET      15.487       99.414
GET      15.615       99.453
GET      15.679       99.492
GET      15.935       99.531
GET      16.191       99.570
GET      16.319       99.609
GET      16.511       99.629
GET      16.511       99.648
GET      16.767       99.668
GET      16.895       99.688
GET      17.023       99.707
GET      17.535       99.727
GET      17.663       99.746
GET      17.919       99.766
GET      17.919       99.785
GET      18.047       99.805
GET      18.175       99.814
GET      18.303       99.824
GET      18.431       99.834
GET      18.687       99.844
GET      18.815       99.854
GET      18.943       99.863
GET      19.199       99.873
GET      19.327       99.883
GET      19.455       99.893
GET      19.583       99.902
GET      19.711       99.907
GET      19.839       99.912
GET      19.967       99.917
GET      20.095       99.922
GET      20.095       99.927
GET      20.095       99.932
GET      20.095       99.937
GET      20.607       99.941
GET      20.735       99.946
GET      20.735       99.951
GET      20.735       99.954
GET      20.735       99.956
GET      20.735       99.958
GET      20.863       99.961
GET      20.863       99.963
GET      20.863       99.966
GET      20.991       99.968
GET      20.991       99.971
GET      20.991       99.973
GET      21.375       99.976
GET      21.375       99.977
GET      21.375       99.978
GET      21.375       99.979
GET      21.375       99.980
GET      21.375       99.982
GET      21.503       99.983
GET      21.759       99.984
GET      22.271       99.985
GET      22.399       99.987
GET      22.399       99.988
GET      22.399       99.988
GET      22.783       99.989
GET      22.783       99.990
GET      22.783       99.990
GET      22.783       99.991
GET      23.551       99.991
GET      23.551       99.992
GET      23.551       99.993
GET      23.551       99.993
GET      25.087       99.994
GET      25.087       99.994
GET      25.087       99.995
GET      25.087       99.995
GET      25.599       99.995
GET      25.599      100.000
---
WAIT      0.000      100.000